# 시리즈 다루기 (응용)

> 평균값 보다 나이많은 사람 구하기

최대값, 평균값 구하기

In [12]:
import pandas as pd
scientists = pd.read_csv('C:/STUDY/StudyPandas/data/scientists.csv')
print(scientists)
ages = scientists['Age']
print('\n')
print(ages.max(),ages.mean())

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician


90 59.125

boolean Array 추출

In [14]:
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

리스트형태로 참이나 거짓을 담아 시리즈에 전달하면 해당 데이터만 추출

In [21]:
manual_bool_values = [False, True, True, True, False, False, False, True]
print(ages[manual_bool_values])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [18]:
ages[ages>ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

> 브로드 캐스팅

In [20]:
print(ages + ages) # 벡터 + 벡터

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [23]:
print(ages+100) # 벡터 + 스칼라

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

길이가 서로 다른 벡터를 연산하는 경우 -> 같은 인덱스의 값만 계산

In [29]:
pd.Series([1,100])

0      1
1    100
dtype: int64

In [25]:
print(ages + pd.Series([1,100])) # 0,1 인덱스만 계산되고 나머지는 누락값(NaN)으로 처리

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

> sort_index([ascending=False])

    인덱스 정렬

In [31]:
rev_ages = ages.sort_index(ascending=False) 
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [34]:
print(ages*2)
print(ages +rev_ages) # 같은결과,같은 위치에 있는 값연산X 같은 인덱스 끼리 연산

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

> Bollean Array

    데이터 프레임의 Age 열의 평균보다 높은 데이터 출력

In [37]:
scientists = pd.read_csv('C:/STUDY/StudyPandas/data/scientists.csv')
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

    데이터 프레임의 Occupation 값이 Chemist인 데이터 출력

In [38]:
print(scientists[scientists['Occupation'] == 'Chemist'])

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

     2,6번인덱스 제외하고 출력

In [ ]:
print(scientists[scientists['Age'] > scientists['Age'].mean()])

> Broadcasting

In [39]:
print(scientists*2) # int 값은 x2, 문자열은 한번더 출력

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

## 열의 자료형 바꾸기

In [40]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [41]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d') # 날짜형식 문자열을 datetime 자료형으로 변경 
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [42]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [43]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [46]:
scientists['Born_dt'],scientists['Died_dt'] = (born_datetime, died_datetime) # 두개의 열을 생성하고 생성된 열에 각각 값을 저장 
print(scientists.head())

                   Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt    Born_dt    Died_dt
0 1958-04-16 1920-07-25 1958-04-16
1 1937-10-16 1876-06-13 1937-10-16
2 1910-08-13 1820-05-12 1910-08-13
3 1934-07-04 1867-11-07 1934-07-04
4 1964-04-14 1907-05-27 1964-04-14

In [49]:
scientists2 = scientists.loc[:,['Name','Born_dt','Died_dt','Age','Occupation']] # Born,Died  지우고 새로 저장 
scientists2

                   Name    Born_dt    Died_dt  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [50]:
scientists['age_days_dt'] = (scientists['died_dt']-scientists['born_dt'])
print(scientists)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt    Born_dt    Died_dt age_days_dt
0 1920-07-25 1958-04-16 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23 1777-04-30 1855-02-23  28422 days

## 데이터 삭제하기 - drop(['인덱스',또는 '열이름'][,axis=n])

In [53]:
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days

In [51]:
scientists.drop(0).head(2)

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days

In [54]:
scientists.drop([0,3])

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23,28422 days

In [57]:
scientists.drop('Name',axis=1) # 열삭제 axis =1

,Born,Died,Age,Occupation,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
0,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,1920-07-25,1958-04-16,13779 days
1,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
3,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,1867-11-07,1934-07-04,24345 days
4,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days
5,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16,16529 days
6,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07,15324 days
7,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23,28422 days

In [59]:
scientists.drop(['Age','Occupation'],axis=1).head(2) # 여러개 열 삭제

,Name,Born,Died,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,1920-07-25,1958-04-16,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days

In [60]:
scientists3 = scientists.copy() # scientists 데이터를 그대로 복사해서 scientist3에 저장 같은객체 X 
scientists3                     # scientists3 = scientists 두개는 같은 객체

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23,28422 days

In [67]:
scientists3.drop(0, inplace=True,axis=0) # 0행이 삭제된 상태로 다시 scientists3에 저장
# 한번 실행후에는 0행이 없으므로 오류날수도있다

KeyError: '[0] not found in axis'

In [68]:
scientists3

,Name,Born,Died,Age,Occupation,born_dt,died_dt,Born_dt,Died_dt,age_days_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,1777-04-30,1855-02-23,28422 days

## 데이터 저장하고 불러오기